{"config": {"layers": [{"config": {"input_length": 63, "dtype": "float32", "input_dim": 40, "output_dim": 128, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding", "mask_zero": false, "embeddings_constraint": null, "trainable": true, "embeddings_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 63]}, "class_name": "Embedding"}, {"config": {"use_bias": true, "dtype": "float32", "bias_regularizer": null, "unroll": false, "stateful": false, "unit_forget_bias": true, "implementation": 2, "recurrent_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "kernel_constraint": null, "recurrent_activation": "sigmoid", "return_sequences": false, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "lstm", "units": 128, "activity_regularizer": null, "go_backwards": false, "recurrent_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "time_major": false, "return_state": false}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "dtype": "float32", "activation": "linear", "kernel_regularizer": null, "name": "dense", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "activation": "sigmoid", "name": "activation", "trainable": true}, "class_name": "Activation"}], "name": "sequential", "build_input_shape": [null, 63]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.0-tf"}